##  1. Importing libraries

In [1]:
import pandas as pd
import numpy as np
import os

## 2.  Importing df_prods from original data & df_ords from prepared Data

In [2]:
import pandas as pd

In [3]:
path=r"C:\Users\tjsra\OneDrive\Desktop\INSTACART BASKET ANALYSIS"

In [4]:
df_prods=pd.read_csv(os.path.join(path, '02 Data', 'Original Data', 'Products.csv'),index_col=False)

In [5]:
df_ords= pd.read_csv(os.path.join(path, '02 Data', 'Prepared Data', 'Orders_Wrangled.csv'), index_col=False)

## 3.  Mixed -Type Data

In [6]:
# ctreate a dataframe
df_test=pd.DataFrame()

In [7]:
# create a mixed type column
df_test['mix']=['a', 'b', 1, True]

In [8]:
df_test.head()

    mix
0     a
1     b
2     1
3  True

In [9]:
# check for any mixed-type columns
for col in df_test.columns.tolist():
    weird = (df_test[col].map(type) != df_test[col].iloc[0].__class__).any()
    if weird:
        print(col)

mix

In [10]:
# covert column's data from numeric to string
df_test['mix'] = df_test['mix'].astype('str')

In [11]:
df_test.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 1 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   mix     4 non-null      object
dtypes: object(1)
memory usage: 164.0+ bytes

### OR

In [12]:
df_test['mix'].dtype

dtype('O')

## 4. Missing Values

In [13]:
df_prods.isnull().sum()

product_id        0
product_name     16
aisle_id          0
department_id     0
prices            0
dtype: int64

In [14]:
df_nan=df_prods[df_prods['product_name'].isnull()==True]

In [15]:
df_nan

       product_id product_name  aisle_id  department_id  prices
33             34          NaN       121             14    12.2
68             69          NaN        26              7    11.8
115           116          NaN        93              3    10.8
261           262          NaN       110             13    12.1
525           525          NaN       109             11     1.2
1511         1511          NaN        84             16    14.3
1780         1780          NaN       126             11    12.3
2240         2240          NaN        52              1    14.2
2586         2586          NaN       104             13    12.4
3159         3159          NaN       126             11    13.1
3230         3230          NaN       120             16    14.4
3736         3736          NaN        41              8    14.8
4283         4283          NaN        77              7    14.4
4790         4790          NaN        91             16    14.5
38187       38183          NaN        39             12    20.9
40444       40440          NaN       120             16    14.8

### Addressing Missing values

In [16]:
df_nan.describe()

         product_id    aisle_id  department_id     prices
count     16.000000   16.000000      16.000000  16.000000
mean    6684.000000   89.937500      10.937500  13.012500
std    12836.665242   33.731229       4.639953   3.881731
min       34.000000   26.000000       1.000000   1.200000
25%      459.250000   70.750000       7.750000  12.175000
50%     2413.000000   98.500000      11.500000  13.650000
75%     3872.750000  120.000000      14.500000  14.425000
max    40440.000000  126.000000      16.000000  20.900000

In [17]:
df_nan.median()

product_id       2413.0
product_name        NaN
aisle_id           98.5
department_id      11.5
prices            13.65
dtype: object

### Missing Values are string so not much do other then  remove it.

In [18]:
df_prods.shape

(49693, 5)

In [19]:
df_prods_clean = df_prods[df_prods['product_name'].isnull() == False]

In [20]:
df_prods_clean.shape

(49677, 5)

## 5. Duplicates

In [21]:
df_dups = df_prods_clean[df_prods_clean.duplicated()]

In [22]:
df_dups

,product_id,product_name,aisle_id,department_id,prices
462,462,Fiber 4g Gummy Dietary Supplement,70,11,4.8
18459,18458,Ranger IPA,27,5,9.2
26810,26808,Black House Coffee Roasty Stout Beer,27,5,13.4
35309,35306,Gluten Free Organic Peanut Butter & Chocolate ...,121,14,6.8
35495,35491,Adore Forever Body Wash,127,11,9.9

### Remove Duplicates

In [23]:
df_prods_clean_no_dups = df_prods_clean.drop_duplicates()

In [24]:
df_prods_clean_no_dups.shape

(49672, 5)

## 6.  Exporting Changes

In [25]:
df_prods_clean_no_dups.to_csv(os.path.join(path, '02 Data','Prepared Data', 'products_checked.csv'))

##  Exercise 4.5  Task

### step 2 observe the data

In [26]:
df_ords.describe()

,Unnamed: 0,order_id,user_id,order_number,order_day_of_week,order_hour_of_day,days_since_last_order
count,1.048575e+06,1.048575e+06,1.048575e+06,1.048575e+06,1.048575e+06,1.048575e+06,985475.000000
mean,5.242870e+05,1.710968e+06,3.156404e+04,1.717418e+01,2.778637e+00,1.345229e+01,11.102506
std,3.026977e+05,9.875774e+05,1.816695e+04,1.771094e+01,2.047751e+00,4.219144e+00,9.186663
min,0.000000e+00,6.000000e+00,1.000000e+00,1.000000e+00,0.000000e+00,0.000000e+00,0.000000
25%,2.621435e+05,8.554670e+05,1.589600e+04,5.000000e+00,1.000000e+00,1.000000e+01,4.000000
50%,5.242870e+05,1.710657e+06,3.160800e+04,1.100000e+01,3.000000e+00,1.300000e+01,7.000000
75%,7.864305e+05,2.566970e+06,4.729700e+04,2.300000e+01,5.000000e+00,1.600000e+01,15.000000
max,1.048574e+06,3.421083e+06,6.310000e+04,1.000000e+02,6.000000e+00,2.300000e+01,30.000000

### The column 'days_since_last_order' has a count of 985,475 which is less then the total number of rows(1,048,575). This indicates that 'days_since_last_order' column contain missing values.It has 30 max value, indictes that orders are capped at 30 days or 1 month. 'order_number' has max value 100, which suggests that 100 orders have placed by users. 'order_day_of_week' column contains min value 0 and max value 6 so total 7 numbers( days of the week). 'order_hour_of_day' column contains min value o and max value 23 so it represents 24 hours of the day.

In [27]:
df_ords.drop(columns=['Unnamed: 0'], inplace =True)

In [28]:
df_ords.describe()

,order_id,user_id,order_number,order_day_of_week,order_hour_of_day,days_since_last_order
count,1.048575e+06,1.048575e+06,1.048575e+06,1.048575e+06,1.048575e+06,985475.000000
mean,1.710968e+06,3.156404e+04,1.717418e+01,2.778637e+00,1.345229e+01,11.102506
std,9.875774e+05,1.816695e+04,1.771094e+01,2.047751e+00,4.219144e+00,9.186663
min,6.000000e+00,1.000000e+00,1.000000e+00,0.000000e+00,0.000000e+00,0.000000
25%,8.554670e+05,1.589600e+04,5.000000e+00,1.000000e+00,1.000000e+01,4.000000
50%,1.710657e+06,3.160800e+04,1.100000e+01,3.000000e+00,1.300000e+01,7.000000
75%,2.566970e+06,4.729700e+04,2.300000e+01,5.000000e+00,1.600000e+01,15.000000
max,3.421083e+06,6.310000e+04,1.000000e+02,6.000000e+00,2.300000e+01,30.000000

## step 3. Mixed Type Data

In [29]:
for col in df_ords.columns.tolist():
    weird = (df_ords[col].map(type) != df_ords[col].iloc[0].__class__).any()
    if weird:
        print(col)

order_id
user_id
order_number
order_day_of_week
order_hour_of_day
days_since_last_order

In [30]:
df_ords.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1048575 entries, 0 to 1048574
Data columns (total 6 columns):
 #   Column                 Non-Null Count    Dtype
---  ------                 --------------    -----
 0   order_id               1048575 non-null  int64
 1   user_id                1048575 non-null  int64
 2   order_number           1048575 non-null  int64
 3   order_day_of_week      1048575 non-null  int64
 4   order_hour_of_day      1048575 non-null  int64
 5   days_since_last_order  985475 non-null   float64
dtypes: float64(1), int64(5)
memory usage: 48.0 MB

### There is no mixed data present in the df_ords dataframe

## Step 5. Missing values in df_ords dataframe

In [31]:
df_ords.isnull().sum()

order_id                     0
user_id                      0
order_number                 0
order_day_of_week            0
order_hour_of_day            0
days_since_last_order    63100
dtype: int64

### 'days_since_last_order' column has 63100 missing values. This column is crucial for understanding customer behaviour, such as their purchasing frequency and patterns and removing missing values would lead to a loss of valuable information so relevant information should be preserved instead of removed.

## Step 6. Addressing the missing values using an appropriate method.

### In order to determine what course of action to take regarding the missing values, we must separate the data from the original dataframe

In [32]:
df_ords_nan = df_ords[df_ords['days_since_last_order'].isnull()==True]

In [33]:
df_ords_nan

,order_id,user_id,order_number,order_day_of_week,order_hour_of_day,days_since_last_order
0,2539329,1,1,2,8,NaN
11,2168274,2,1,2,11,NaN
26,1374495,3,1,1,14,NaN
39,3343014,4,1,6,11,NaN
45,2717275,5,1,3,12,NaN
...,...,...,...,...,...,...
1048523,1591766,63096,1,0,20,NaN
1048530,3391694,63097,1,2,14,NaN
1048541,1270497,63098,1,3,16,NaN
1048556,1877750,63099,1,0,10,NaN
1048570,1805240,63100,1,0,11,NaN

### Now we have to check that all 'order_number' values equal to 1 are missing values in the 'days_since_last_order' column

### filter the Data frame where 'order_number' equal 1

In [34]:
df_first_orders = df_ords_nan[df_ords_nan['order_number'] == '1']

### check if all of these have missing value in 'days_since_last_order'

In [35]:
df_first_orders_missing = df_first_orders['days_since_last_order'].isna().all()

### Print the result

In [36]:
print("All first orders have missing 'days_since_last_order':", df_first_orders_missing)

All first orders have missing 'days_since_last_order': True

### we know that every row with 'order number' equal to 1 has a missing value in the 'days_since_last_order' column. Now address the missing value by creating a column that flags order number as either True/False depending on if the the 'order_number' = 1

In [37]:
df_ords['first_order'] = df_ords['days_since_last_order'].isna()

In [38]:
df_ords

,order_id,user_id,order_number,order_day_of_week,order_hour_of_day,days_since_last_order,first_order
0,2539329,1,1,2,8,NaN,True
1,2398795,1,2,3,7,15.0,False
2,473747,1,3,3,12,21.0,False
3,2254736,1,4,4,7,29.0,False
4,431534,1,5,4,15,28.0,False
...,...,...,...,...,...,...,...
1048570,1805240,63100,1,0,11,NaN,True
1048571,2719402,63100,2,0,8,14.0,False
1048572,2855250,63100,3,2,13,16.0,False
1048573,2355832,63100,4,5,16,30.0,False
1048574,2362552,63100,5,1,13,30.0,False

## Step 7   Duplicates

In [39]:
df_ords_dup = df_ords[df_ords.duplicated()]

In [40]:
df_ords_dup

Empty DataFrame
Columns: [order_id, user_id, order_number, order_day_of_week, order_hour_of_day, days_since_last_order, first_order]
Index: []

### this means there are no duplicates in the dataset.

## step 9 Exporting changes

In [41]:
df_ords.to_csv(os.path.join(path, '02 Data','Prepared Data', 'orders_checked.csv'))

In [42]:
print(df_ords.columns)

Index(['order_id', 'user_id', 'order_number', 'order_day_of_week',
       'order_hour_of_day', 'days_since_last_order', 'first_order'],
      dtype='object')